InformationRegisters/фин_ПравилаСценарногоПланированияСтатейБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ПравилаСценарногоПланированияСтатейБюджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныйСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоправочныйКоэффициентКСумме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоправочныйКоэффициентККоличеству</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормулаКоличество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоРасценкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФормируемыйСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособыЗаполненияСтатейПриСценарныхРасчетах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбщемуПравилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПрименениемКоэффициента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуле</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/фин_ПравилаСценарногоПланированияСтатейБюджетов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ПорядокРасчета = ?(Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.НеЗаполнять ИЛИ Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.ПоОбщемуПравилу,
								Строка(Запись.СпособЗаполнения),
								"По данным сценария"+?(ЗначениеЗаполнено(Запись.ИсходныйСценарий)," """+Строка(Запись.ИсходныйСценарий)+"""","")+", "+
									?(Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.СПрименениемКоэффициента,
									" К. сум.: "+Строка(Запись.ПоправочныйКоэффициентКСумме)+", К. кол.: "+Строка(Запись.ПоправочныйКоэффициентККоличеству)+", Лаг: "+Строка(Запись.Лаг),
									?(ЗначениеЗаполнено(Запись.ФормулаКоличество),"Кол. по ф-ле: "+Строка(Запись.ФормулаКоличество)+", ","")+?(Запись.СуммаПоРасценкам,"Сумма по расценкам","Сум. по ф-ле: "+Строка(Запись.Формула))));
	КонецЦикла;
КонецПроцедуры
